Data importing

In [1]:
import pandas as pd
import numpy as np

In [2]:
practisedata=pd.read_csv("C:/Users/DELL-IN/Downloads/Video/AL/mydata.csv")

In [3]:
practisedata.head(15)

    ID Name Gender   Age     School  Absent  Marks
0    1    A      M  20.0  St Thomas     2.0  402.0
1    2    B      F  24.0  St Thomas     3.0  387.0
2    3    C      M  19.0   St Marys     6.0    NaN
3    4    D      M   NaN  St Thomas     0.0  452.0
4    5    E      F  21.0   St Marys     8.0  348.0
5    6    F      F  19.0   St Marys     NaN  299.0
6    7    G      M  34.0  St Thomas     2.0  490.0
7    8    H      M   NaN  St Thomas     8.0  372.0
8    9    I      F  21.0  St Thomas    12.0  340.0
9   10    J      F  23.0   St Marys    10.0  415.0
10  10    J      F  23.0   St Marys    10.0  415.0

Data Understanding

In [4]:
practisedata.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks'], dtype='object')

In [5]:
practisedata.shape

(11, 7)

In [6]:
practisedata.size

77

In [7]:
practisedata.dtypes

ID          int64
Name       object
Gender     object
Age       float64
School     object
Absent    float64
Marks     float64
dtype: object

In [8]:
practisedata.get_dtype_counts()

float64    3
int64      1
object     3
dtype: int64

In [9]:
practisedata.ndim

2

In [10]:
practisedata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
ID        11 non-null int64
Name      11 non-null object
Gender    11 non-null object
Age       9 non-null float64
School    11 non-null object
Absent    10 non-null float64
Marks     10 non-null float64
dtypes: float64(3), int64(1), object(3)
memory usage: 696.0+ bytes

In [11]:
practisedata.describe().T

        count        mean        std    min     25%    50%    75%    max
ID       11.0    5.909091   3.176619    1.0    3.50    6.0    8.5   10.0
Age       9.0   22.666667   4.609772   19.0   20.00   21.0   23.0   34.0
Absent   10.0    6.100000   4.121758    0.0    2.25    7.0    9.5   12.0
Marks    10.0  392.000000  55.852982  299.0  354.00  394.5  415.0  490.0

Data Manipulation

In [12]:
practisedata[['ID','Name','Marks']]

    ID Name  Marks
0    1    A  402.0
1    2    B  387.0
2    3    C    NaN
3    4    D  452.0
4    5    E  348.0
5    6    F  299.0
6    7    G  490.0
7    8    H  372.0
8    9    I  340.0
9   10    J  415.0
10  10    J  415.0

In [13]:
practisedata.iloc[[1,2,4],[1,2,5]]

  Name Gender  Absent
1    B      F     3.0
2    C      M     6.0
4    E      F     8.0

In [14]:
practisedata.iloc[[1,2,4],:]

   ID Name Gender   Age     School  Absent  Marks
1   2    B      F  24.0  St Thomas     3.0  387.0
2   3    C      M  19.0   St Marys     6.0    NaN
4   5    E      F  21.0   St Marys     8.0  348.0

In [15]:
practisedata.loc[:,'ID']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    10
Name: ID, dtype: int64

In [16]:
practisedata.loc[1:2,'ID']

1    2
2    3
Name: ID, dtype: int64

In [17]:
practisedata.loc[1:2,['ID', 'Name']]

   ID Name
1   2    B
2   3    C

In [18]:
practisedata.loc[[1,2,4],:]

   ID Name Gender   Age     School  Absent  Marks
1   2    B      F  24.0  St Thomas     3.0  387.0
2   3    C      M  19.0   St Marys     6.0    NaN
4   5    E      F  21.0   St Marys     8.0  348.0

In [19]:
(practisedata.Absent<5) & (practisedata.Marks>400)

0      True
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9     False
10    False
dtype: bool

In [20]:
practisedata[(practisedata.Absent<5) & (practisedata.Marks>400)]

   ID Name Gender   Age     School  Absent  Marks
0   1    A      M  20.0  St Thomas     2.0  402.0
3   4    D      M   NaN  St Thomas     0.0  452.0
6   7    G      M  34.0  St Thomas     2.0  490.0

New variables

In [21]:
practisedata.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks'], dtype='object')

In [22]:
practisedata['Percentage']=(practisedata['Marks']/500)*100

In [23]:
practisedata.head()

   ID Name Gender   Age     School  Absent  Marks  Percentage
0   1    A      M  20.0  St Thomas     2.0  402.0        80.4
1   2    B      F  24.0  St Thomas     3.0  387.0        77.4
2   3    C      M  19.0   St Marys     6.0    NaN         NaN
3   4    D      M   NaN  St Thomas     0.0  452.0        90.4
4   5    E      F  21.0   St Marys     8.0  348.0        69.6

In [24]:
practisedata.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks',
       'Percentage'],
      dtype='object')

Dropping variables

In [26]:
practisedata1=practisedata.copy()

In [27]:
practisedata1.head()

   ID Name Gender   Age     School  Absent  Marks  Percentage
0   1    A      M  20.0  St Thomas     2.0  402.0        80.4
1   2    B      F  24.0  St Thomas     3.0  387.0        77.4
2   3    C      M  19.0   St Marys     6.0    NaN         NaN
3   4    D      M   NaN  St Thomas     0.0  452.0        90.4
4   5    E      F  21.0   St Marys     8.0  348.0        69.6

In [28]:
practisedata1.drop(['Percentage'],axis=1)
practisedata1

    ID Name Gender   Age     School  Absent  Marks  Percentage
0    1    A      M  20.0  St Thomas     2.0  402.0        80.4
1    2    B      F  24.0  St Thomas     3.0  387.0        77.4
2    3    C      M  19.0   St Marys     6.0    NaN         NaN
3    4    D      M   NaN  St Thomas     0.0  452.0        90.4
4    5    E      F  21.0   St Marys     8.0  348.0        69.6
5    6    F      F  19.0   St Marys     NaN  299.0        59.8
6    7    G      M  34.0  St Thomas     2.0  490.0        98.0
7    8    H      M   NaN  St Thomas     8.0  372.0        74.4
8    9    I      F  21.0  St Thomas    12.0  340.0        68.0
9   10    J      F  23.0   St Marys    10.0  415.0        83.0
10  10    J      F  23.0   St Marys    10.0  415.0        83.0

In [29]:
practisedata1.drop(['Percentage'],axis=1,inplace=True)
practisedata1

    ID Name Gender   Age     School  Absent  Marks
0    1    A      M  20.0  St Thomas     2.0  402.0
1    2    B      F  24.0  St Thomas     3.0  387.0
2    3    C      M  19.0   St Marys     6.0    NaN
3    4    D      M   NaN  St Thomas     0.0  452.0
4    5    E      F  21.0   St Marys     8.0  348.0
5    6    F      F  19.0   St Marys     NaN  299.0
6    7    G      M  34.0  St Thomas     2.0  490.0
7    8    H      M   NaN  St Thomas     8.0  372.0
8    9    I      F  21.0  St Thomas    12.0  340.0
9   10    J      F  23.0   St Marys    10.0  415.0
10  10    J      F  23.0   St Marys    10.0  415.0

In [30]:
practisedata1.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks'], dtype='object')

In [31]:
practisedata1.drop(4,axis=0).head()

   ID Name Gender   Age     School  Absent  Marks
0   1    A      M  20.0  St Thomas     2.0  402.0
1   2    B      F  24.0  St Thomas     3.0  387.0
2   3    C      M  19.0   St Marys     6.0    NaN
3   4    D      M   NaN  St Thomas     0.0  452.0
5   6    F      F  19.0   St Marys     NaN  299.0

In [32]:
practisedata.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks',
       'Percentage'],
      dtype='object')

In [33]:
practisedata1.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks'], dtype='object')

In [ ]:
#practisedata['Percentage']=(practisedata['Marks']/500)*100

In [34]:
practisedata

    ID Name Gender   Age     School  Absent  Marks  Percentage
0    1    A      M  20.0  St Thomas     2.0  402.0        80.4
1    2    B      F  24.0  St Thomas     3.0  387.0        77.4
2    3    C      M  19.0   St Marys     6.0    NaN         NaN
3    4    D      M   NaN  St Thomas     0.0  452.0        90.4
4    5    E      F  21.0   St Marys     8.0  348.0        69.6
5    6    F      F  19.0   St Marys     NaN  299.0        59.8
6    7    G      M  34.0  St Thomas     2.0  490.0        98.0
7    8    H      M   NaN  St Thomas     8.0  372.0        74.4
8    9    I      F  21.0  St Thomas    12.0  340.0        68.0
9   10    J      F  23.0   St Marys    10.0  415.0        83.0
10  10    J      F  23.0   St Marys    10.0  415.0        83.0

Binning Data

In [35]:
practisedata['Marks'].head()

0    402.0
1    387.0
2      NaN
3    452.0
4    348.0
Name: Marks, dtype: float64

In [36]:
pd.cut(practisedata['Marks'],3,labels=['great','excellent','awesome'])

0     excellent
1     excellent
2           NaN
3       awesome
4         great
5         great
6       awesome
7     excellent
8         great
9     excellent
10    excellent
Name: Marks, dtype: category
Categories (3, object): [great < excellent < awesome]

In [37]:
pd.cut(practisedata['Marks'],bins=[0, 350,400,500],labels=['great','excellent','awesome'])

0       awesome
1     excellent
2           NaN
3       awesome
4         great
5         great
6       awesome
7     excellent
8         great
9       awesome
10      awesome
Name: Marks, dtype: category
Categories (3, object): [great < excellent < awesome]

In [38]:
practisedata['MarksBucket']=pd.cut(practisedata['Marks'],bins=[0, 350,400,500], labels=['great','excellent','awesome'])

In [39]:
practisedata

    ID Name Gender   Age     School  Absent  Marks  Percentage MarksBucket
0    1    A      M  20.0  St Thomas     2.0  402.0        80.4     awesome
1    2    B      F  24.0  St Thomas     3.0  387.0        77.4   excellent
2    3    C      M  19.0   St Marys     6.0    NaN         NaN         NaN
3    4    D      M   NaN  St Thomas     0.0  452.0        90.4     awesome
4    5    E      F  21.0   St Marys     8.0  348.0        69.6       great
5    6    F      F  19.0   St Marys     NaN  299.0        59.8       great
6    7    G      M  34.0  St Thomas     2.0  490.0        98.0     awesome
7    8    H      M   NaN  St Thomas     8.0  372.0        74.4   excellent
8    9    I      F  21.0  St Thomas    12.0  340.0        68.0       great
9   10    J      F  23.0   St Marys    10.0  415.0        83.0     awesome
10  10    J      F  23.0   St Marys    10.0  415.0        83.0     awesome

In [40]:
practisedata['MarksBucket'].value_counts()

awesome      5
great        3
excellent    2
Name: MarksBucket, dtype: int64

Renaming Columns

In [41]:
practisedata.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks',
       'Percentage', 'MarksBucket'],
      dtype='object')

In [42]:
practisedata=practisedata.rename(columns={'Grades': 'Grade', 'Percentage':'Percentages'})

In [43]:
practisedata.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks',
       'Percentages', 'MarksBucket'],
      dtype='object')

Sorting Data

In [44]:
practisedata.sort_values(by='Marks',ascending=False)

    ID Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
6    7    G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
3    4    D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
9   10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome
10  10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome
0    1    A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
1    2    B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
7    8    H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
4    5    E      F  21.0   St Marys     8.0  348.0         69.6       great
8    9    I      F  21.0  St Thomas    12.0  340.0         68.0       great
5    6    F      F  19.0   St Marys     NaN  299.0         59.8       great
2    3    C      M  19.0   St Marys     6.0    NaN          NaN         NaN

In [45]:
practisedata.sort_values(by=['Marks','Absent'],ascending=[False,True])

    ID Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
6    7    G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
3    4    D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
9   10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome
10  10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome
0    1    A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
1    2    B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
7    8    H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
4    5    E      F  21.0   St Marys     8.0  348.0         69.6       great
8    9    I      F  21.0  St Thomas    12.0  340.0         68.0       great
5    6    F      F  19.0   St Marys     NaN  299.0         59.8       great
2    3    C      M  19.0   St Marys     6.0    NaN          NaN         NaN

Resetting Index

In [46]:
practisedata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 9 columns):
ID             11 non-null int64
Name           11 non-null object
Gender         11 non-null object
Age            9 non-null float64
School         11 non-null object
Absent         10 non-null float64
Marks          10 non-null float64
Percentages    10 non-null float64
MarksBucket    10 non-null category
dtypes: category(1), float64(4), int64(1), object(3)
memory usage: 899.0+ bytes

In [47]:
practisedata['ID']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    10
Name: ID, dtype: int64

In [48]:
practisedata2=practisedata.set_index('ID')

In [49]:
practisedata2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 1 to 10
Data columns (total 8 columns):
Name           11 non-null object
Gender         11 non-null object
Age            9 non-null float64
School         11 non-null object
Absent         10 non-null float64
Marks          10 non-null float64
Percentages    10 non-null float64
MarksBucket    10 non-null category
dtypes: category(1), float64(4), object(3)
memory usage: 819.0+ bytes

In [50]:
practisedata2

   Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
ID
1     A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
2     B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
3     C      M  19.0   St Marys     6.0    NaN          NaN         NaN
4     D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
5     E      F  21.0   St Marys     8.0  348.0         69.6       great
6     F      F  19.0   St Marys     NaN  299.0         59.8       great
7     G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
8     H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
9     I      F  21.0  St Thomas    12.0  340.0         68.0       great
10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome
10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome

In [51]:
practisedata2.reset_index(inplace=True)

In [52]:
practisedata2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 9 columns):
ID             11 non-null int64
Name           11 non-null object
Gender         11 non-null object
Age            9 non-null float64
School         11 non-null object
Absent         10 non-null float64
Marks          10 non-null float64
Percentages    10 non-null float64
MarksBucket    10 non-null category
dtypes: category(1), float64(4), int64(1), object(3)
memory usage: 899.0+ bytes

In [53]:
practisedata2

    ID Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
0    1    A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
1    2    B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
2    3    C      M  19.0   St Marys     6.0    NaN          NaN         NaN
3    4    D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
4    5    E      F  21.0   St Marys     8.0  348.0         69.6       great
5    6    F      F  19.0   St Marys     NaN  299.0         59.8       great
6    7    G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
7    8    H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
8    9    I      F  21.0  St Thomas    12.0  340.0         68.0       great
9   10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome
10  10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome

Handling Duplicates

In [54]:
practisedata

    ID Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
0    1    A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
1    2    B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
2    3    C      M  19.0   St Marys     6.0    NaN          NaN         NaN
3    4    D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
4    5    E      F  21.0   St Marys     8.0  348.0         69.6       great
5    6    F      F  19.0   St Marys     NaN  299.0         59.8       great
6    7    G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
7    8    H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
8    9    I      F  21.0  St Thomas    12.0  340.0         68.0       great
9   10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome
10  10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome

In [55]:
sum(practisedata.duplicated())

1

In [56]:
dups=practisedata[practisedata.duplicated()==True]
unique=practisedata[practisedata.duplicated()==False]
unique1=practisedata.drop_duplicates()

In [57]:
print(practisedata.shape)
print(dups.shape)
print(unique.shape)
print(unique1.shape)

(11, 9)
(1, 9)
(10, 9)
(10, 9)

In [58]:
practisedata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 9 columns):
ID             11 non-null int64
Name           11 non-null object
Gender         11 non-null object
Age            9 non-null float64
School         11 non-null object
Absent         10 non-null float64
Marks          10 non-null float64
Percentages    10 non-null float64
MarksBucket    10 non-null category
dtypes: category(1), float64(4), int64(1), object(3)
memory usage: 899.0+ bytes

In [59]:
dups=practisedata[practisedata['ID'].duplicated()==True]
unique=practisedata[practisedata['ID'].duplicated()==False]

print(dups.shape)
print(unique.shape)

(1, 9)
(10, 9)

In [60]:
practisedata.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

In [61]:
practisedata[practisedata.duplicated()]

    ID Name Gender   Age    School  Absent  Marks  Percentages MarksBucket
10  10    J      F  23.0  St Marys    10.0  415.0         83.0     awesome

In [62]:
practisedata[-practisedata.duplicated()]

   ID Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
0   1    A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
1   2    B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
2   3    C      M  19.0   St Marys     6.0    NaN          NaN         NaN
3   4    D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
4   5    E      F  21.0   St Marys     8.0  348.0         69.6       great
5   6    F      F  19.0   St Marys     NaN  299.0         59.8       great
6   7    G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
7   8    H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
8   9    I      F  21.0  St Thomas    12.0  340.0         68.0       great
9  10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome

In [63]:
practisedata.drop_duplicates(inplace=True)  #retain first occurrence

In [64]:
practisedata

   ID Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
0   1    A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
1   2    B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
2   3    C      M  19.0   St Marys     6.0    NaN          NaN         NaN
3   4    D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
4   5    E      F  21.0   St Marys     8.0  348.0         69.6       great
5   6    F      F  19.0   St Marys     NaN  299.0         59.8       great
6   7    G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
7   8    H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
8   9    I      F  21.0  St Thomas    12.0  340.0         68.0       great
9  10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome

Handling Missing Data

In [65]:
practisedata

   ID Name Gender   Age     School  Absent  Marks  Percentages MarksBucket
0   1    A      M  20.0  St Thomas     2.0  402.0         80.4     awesome
1   2    B      F  24.0  St Thomas     3.0  387.0         77.4   excellent
2   3    C      M  19.0   St Marys     6.0    NaN          NaN         NaN
3   4    D      M   NaN  St Thomas     0.0  452.0         90.4     awesome
4   5    E      F  21.0   St Marys     8.0  348.0         69.6       great
5   6    F      F  19.0   St Marys     NaN  299.0         59.8       great
6   7    G      M  34.0  St Thomas     2.0  490.0         98.0     awesome
7   8    H      M   NaN  St Thomas     8.0  372.0         74.4   excellent
8   9    I      F  21.0  St Thomas    12.0  340.0         68.0       great
9  10    J      F  23.0   St Marys    10.0  415.0         83.0     awesome

In [66]:
print(sum(practisedata['Marks'].notnull()))
print(sum(practisedata['Marks'].isnull()))

9
1

In [67]:
mean_marks=practisedata['Marks'].mean()
mean_marks

389.44444444444446

In [68]:
practisedata['Marks']=practisedata['Marks'].fillna(mean_marks)

In [69]:
median_age=practisedata['Age'].median()
median_age

21.0

In [70]:
practisedata['Age']=practisedata['Age'].fillna(median_age)

In [71]:
median_absent=practisedata['Absent'].median()
median_absent

6.0

In [72]:
practisedata['Absent']=practisedata['Absent'].fillna(median_absent)

In [73]:
practisedata

,ID,Name,Gender,Age,School,Absent,Marks,Percentages,MarksBucket
0,1,A,M,20.0,St Thomas,2.0,402.000000,80.4,awesome
1,2,B,F,24.0,St Thomas,3.0,387.000000,77.4,excellent
2,3,C,M,19.0,St Marys,6.0,389.444444,NaN,NaN
3,4,D,M,21.0,St Thomas,0.0,452.000000,90.4,awesome
4,5,E,F,21.0,St Marys,8.0,348.000000,69.6,great
5,6,F,F,19.0,St Marys,6.0,299.000000,59.8,great
6,7,G,M,34.0,St Thomas,2.0,490.000000,98.0,awesome
7,8,H,M,21.0,St Thomas,8.0,372.000000,74.4,excellent
8,9,I,F,21.0,St Thomas,12.0,340.000000,68.0,great
9,10,J,F,23.0,St Marys,10.0,415.000000,83.0,awesome

In [74]:
print(practisedata['Marks'].quantile(.95))

472.9

In [75]:
print(practisedata['Age'].quantile(.95))

29.49999999999999

In [76]:
practisedata['Marks']=(practisedata['Marks'].clip_upper(practisedata['Marks'].quantile(.95)))

In [77]:
practisedata['Age']=(practisedata['Age'].clip_upper(practisedata['Age'].quantile(.95)))

In [78]:
practisedata

,ID,Name,Gender,Age,School,Absent,Marks,Percentages,MarksBucket
0,1,A,M,20.0,St Thomas,2.0,402.000000,80.4,awesome
1,2,B,F,24.0,St Thomas,3.0,387.000000,77.4,excellent
2,3,C,M,19.0,St Marys,6.0,389.444444,NaN,NaN
3,4,D,M,21.0,St Thomas,0.0,452.000000,90.4,awesome
4,5,E,F,21.0,St Marys,8.0,348.000000,69.6,great
5,6,F,F,19.0,St Marys,6.0,299.000000,59.8,great
6,7,G,M,29.5,St Thomas,2.0,472.900000,98.0,awesome
7,8,H,M,21.0,St Thomas,8.0,372.000000,74.4,excellent
8,9,I,F,21.0,St Thomas,12.0,340.000000,68.0,great
9,10,J,F,23.0,St Marys,10.0,415.000000,83.0,awesome

In [79]:
practisedata['Percentages']=(practisedata['Marks']/500)*100

In [80]:
practisedata['MarksBucket']=pd.cut(practisedata['Marks'],bins=[0, 350,400,500], labels=['great','excellent','awesome'])

In [81]:
practisedata

,ID,Name,Gender,Age,School,Absent,Marks,Percentages,MarksBucket
0,1,A,M,20.0,St Thomas,2.0,402.000000,80.400000,awesome
1,2,B,F,24.0,St Thomas,3.0,387.000000,77.400000,excellent
2,3,C,M,19.0,St Marys,6.0,389.444444,77.888889,excellent
3,4,D,M,21.0,St Thomas,0.0,452.000000,90.400000,awesome
4,5,E,F,21.0,St Marys,8.0,348.000000,69.600000,great
5,6,F,F,19.0,St Marys,6.0,299.000000,59.800000,great
6,7,G,M,29.5,St Thomas,2.0,472.900000,94.580000,awesome
7,8,H,M,21.0,St Thomas,8.0,372.000000,74.400000,excellent
8,9,I,F,21.0,St Thomas,12.0,340.000000,68.000000,great
9,10,J,F,23.0,St Marys,10.0,415.000000,83.000000,awesome

Handling Categorical variables- Creates dummies

In [82]:
x=pd.get_dummies(practisedata['MarksBucket'],prefix='M')

In [83]:
x

   M_great  M_excellent  M_awesome
0        0            0          1
1        0            1          0
2        0            1          0
3        0            0          1
4        1            0          0
5        1            0          0
6        0            0          1
7        0            1          0
8        1            0          0
9        0            0          1

In [84]:
practisedata=pd.concat([practisedata,x],axis=1).drop('MarksBucket',axis=1)

In [85]:
practisedata

,ID,Name,Gender,Age,School,Absent,Marks,Percentages,M_great,M_excellent,M_awesome
0,1,A,M,20.0,St Thomas,2.0,402.000000,80.400000,0,0,1
1,2,B,F,24.0,St Thomas,3.0,387.000000,77.400000,0,1,0
2,3,C,M,19.0,St Marys,6.0,389.444444,77.888889,0,1,0
3,4,D,M,21.0,St Thomas,0.0,452.000000,90.400000,0,0,1
4,5,E,F,21.0,St Marys,8.0,348.000000,69.600000,1,0,0
5,6,F,F,19.0,St Marys,6.0,299.000000,59.800000,1,0,0
6,7,G,M,29.5,St Thomas,2.0,472.900000,94.580000,0,0,1
7,8,H,M,21.0,St Thomas,8.0,372.000000,74.400000,0,1,0
8,9,I,F,21.0,St Thomas,12.0,340.000000,68.000000,1,0,0
9,10,J,F,23.0,St Marys,10.0,415.000000,83.000000,0,0,1

Apply functions to each element/rows or columns of a DataFrame

Using

s.map(), apply a func to each element of a Series
df.applymap() apply a func to each element of a DF
df.apply() apply a func to rows/columns of a DF

Lambda functions are also known as ANONYMOUS functions because they typically do not have a name.

The are used extensively in Python, and even more with the map(), applymap() and apply() methods

In [86]:
df = pd.DataFrame(np.random.randn(25).reshape(5,5), 
                index=list('abcde'), 
                columns=list('vwxyz')).round(2); 
df

      v     w     x     y     z
a -0.63 -1.13 -0.45  2.12 -0.67
b -2.44  0.09 -0.71  0.20  0.88
c  0.27  0.49  1.80  1.05 -0.18
d -2.05 -0.19  0.69 -1.41  0.52
e -1.12 -0.79 -0.24  0.08  0.66

In [87]:
# Write a function that formats a number to 2 decimal places
format8 = lambda x: '%.1f' %x

# SAME AS
# def format8(x):
#     return '%.2f' %x


# Apply this function to each element of the Series
print(df.applymap(format8))

# Apply the function over columns
# Get the RANGE of each column
print(df.apply(lambda x: x.max() - x.min()))

      v     w     x     y     z
a  -0.6  -1.1  -0.5   2.1  -0.7
b  -2.4   0.1  -0.7   0.2   0.9
c   0.3   0.5   1.8   1.1  -0.2
d  -2.0  -0.2   0.7  -1.4   0.5
e  -1.1  -0.8  -0.2   0.1   0.7
v    2.71
w    1.62
x    2.51
y    3.53
z    1.55
dtype: float64

In [88]:
# Use a general function that returns multiple values
def func8(x):
    return pd.Series([x.min(), x.mean(), x.max()], 
                  index=['MIN.', 'MEAN.', 'MAX.'])

df.apply(lambda x: func8(x))

           v      w      x      y      z
MIN.  -2.440 -1.130 -0.710 -1.410 -0.670
MEAN. -1.194 -0.306  0.218  0.408  0.242
MAX.   0.270  0.490  1.800  2.120  0.880

In [89]:
# Over Rows
df.apply(func8, axis=1)

   MIN.  MEAN.  MAX.
a -1.13 -0.152  2.12
b -2.44 -0.396  0.88
c -0.18  0.686  1.80
d -2.05 -0.488  0.69
e -1.12 -0.282  0.66

Table Manipulations

Implementing Split-Apply-Combine: The groupby method

In [90]:
practisedata.columns

Index(['ID', 'Name', 'Gender', 'Age', 'School', 'Absent', 'Marks',
       'Percentages', 'M_great', 'M_excellent', 'M_awesome'],
      dtype='object')

In [91]:
practisedata[['Gender','Marks']].groupby('Gender').mean()

             Marks
Gender
F       357.800000
M       417.668889

In [92]:
practisedata[['School','Gender','Marks']].groupby(['School','Gender']).agg(['max','min','sum','mean','median','std'])

                       Marks                                                   \
                         max         min          sum        mean      median
School    Gender
St Marys  F       415.000000  299.000000  1062.000000  354.000000  348.000000
          M       389.444444  389.444444   389.444444  389.444444  389.444444
St Thomas F       387.000000  340.000000   727.000000  363.500000  363.500000
          M       472.900000  372.000000  1698.900000  424.725000  427.000000


                        std
School    Gender
St Marys  F       58.232293
          M             NaN
St Thomas F       33.234019
          M       46.047466

In [93]:
g=practisedata[['School','Gender','Marks']].groupby(['School','Gender'])

In [94]:
pd.DataFrame(pd.concat([g.max(), g.min(), g.sum(), g.mean(), g.median(), g.std()], axis=1).values, 
             columns=['Max', 'Min', 'sum','avg', 'median', 'std'])

          Max         Min          sum         avg      median        std
0  415.000000  299.000000  1062.000000  354.000000  348.000000  58.232293
1  389.444444  389.444444   389.444444  389.444444  389.444444        NaN
2  387.000000  340.000000   727.000000  363.500000  363.500000  33.234019
3  472.900000  372.000000  1698.900000  424.725000  427.000000  46.047466

MERGING - JOINING

In [95]:
df0 = pd.DataFrame({'key': ['a', 'b', 'c', 'd', 'e'], 'data0': np.random.randint(0, 100, 5)})
df1 = pd.DataFrame({'key': ['a', 'b', 'd', 'f', 'g'], 'data2': np.random.randint(0, 100, 5)})
print('df0\n', df0, '\ndf1\n',df1)

df0
   key  data0
0   a     34
1   b     20
2   c     76
3   d     86
4   e     80
df1
   key  data2
0   a     89
1   b     32
2   d     74
3   f     12
4   g      6

In [96]:
# Inner Join (Default)

print(pd.merge(df0, df1))
# or
#print pd.merge(df0, df1, how='inner', on='key')

# We see that its an inner join by default (output key is the intersection of input keys)
# Merge happens on the column 'key' which is common to both datasets;
    # We could've written pd.merge(df1, df2, on='key', how='inner') to the same effect

  key  data0  data2
0   a     34     89
1   b     20     32
2   d     86     74

In [97]:
# Left Join
print(pd.merge(df0, df1, how='left'))

# The output table has all the key values from the left table, and matching ones from the right

  key  data0  data2
0   a     34   89.0
1   b     20   32.0
2   c     76    NaN
3   d     86   74.0
4   e     80    NaN

In [98]:
# Right Join
print(pd.merge(df0, df1, how='right'))

# The output table has all the key values from the right table, and matching ones from the left

  key  data0  data2
0   a   34.0     89
1   b   20.0     32
2   d   86.0     74
3   f    NaN     12
4   g    NaN      6

In [99]:
# Outer Join
print(pd.merge(df0, df1, how='outer'))

# The output table has a UNION of the keys

  key  data0  data2
0   a   34.0   89.0
1   b   20.0   32.0
2   c   76.0    NaN
3   d   86.0   74.0
4   e   80.0    NaN
5   f    NaN   12.0
6   g    NaN    6.0

In [100]:
# Check the common columns are exist or not
print(df0.columns.tolist())
print(df1.columns.tolist())

print(np.intersect1d(df0.columns.tolist(), df1.columns.tolist()))

#pd.merge(df1, df4) 
# would yield an error because there are no matching column names to merge on 
# If there are no common keys, `pd.merge` will throw a `MergeError

['key', 'data0']
['key', 'data2']
['key']

The .join() method

In [110]:
df = pd.DataFrame(np.random.randint(0, 50, 32).reshape(8, 4), columns=list('WXYZ'), index=list('abcdefgh'))

df1 = df.ix[2:, ['W', 'X']]
df2 = df.ix[:5, ['Y', 'Z']]

print(df, '\n\n', df1, '\n\n', df2)

    W   X   Y   Z
a  49  28  44   8
b  31  36  33  16
c   8  39  17  17
d  43  17  30  31
e  35  13  24   9
f  43  18   9  38
g   7  23   4   9
h  46  48   4  45

     W   X
c   8  39
d  43  17
e  35  13
f  43  18
g   7  23
h  46  48

     Y   Z
a  44   8
b  33  16
c  17  17
d  30  31
e  24   9

C:\Users\DELL-IN\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\DELL-IN\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

In [111]:
# Default actions is a left join on the indexes
df1.join(df2)

    W   X     Y     Z
c   8  39  17.0  17.0
d  43  17  30.0  31.0
e  35  13  24.0   9.0
f  43  18   NaN   NaN
g   7  23   NaN   NaN
h  46  48   NaN   NaN

In [112]:
pd.merge(df1, df2, how='left', 
         right_index=True, left_index=True)

    W   X     Y     Z
c   8  39  17.0  17.0
d  43  17  30.0  31.0
e  35  13  24.0   9.0
f  43  18   NaN   NaN
g   7  23   NaN   NaN
h  46  48   NaN   NaN

In [104]:
# Create a couple more DFs with the same index
df3 = df.ix[0:3, ['X', 'Z']]
df3.columns = ['P', 'Q']

df4 = df.ix[4:6, ['W']]
df4.columns = ['R']

print(df3, "\n\n", df4)

    P   Q
a   4  47
b  19  48
c  44  46

     R
e  36
f  28

C:\Users\DELL-IN\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\DELL-IN\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """

In [113]:
# Merging multiple DFs with the same index by passing a list of names to .join
df1.join([df2, df3, df4]).fillna('')

    W   X   Y   Z   P   Q   R
c   8  39  17  17  44  46
d  43  17  30  31
e  35  13  24   9          36
f  43  18                  28
g   7  23
h  46  48

In [114]:
df2.join([df1, df3, df4], how='outer').fillna('')

C:\Users\DELL-IN\Anaconda3\lib\site-packages\pandas\core\frame.py:6359: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  verify_integrity=True)

    Y   Z   W   X   P   Q   R
a  44   8           4  47
b  33  16          19  48
c  17  17   8  39  44  46
d  30  31  43  17
e  24   9  35  13          36
f          43  18          28
g           7  23
h          46  48

Concatenating DataFrames
- (aka binding, stacking, union all)
a. Series objects with small index overlap
* concat with axis=0 (default) will append the Series (~rbind)
* concat with axis=1 will merge the Series to produce a DF (~outer join)

In [115]:
# Create toy Series with non-overlapping indices
s1 = pd.Series(np.random.randn(3).round(2), index=list('abc'), name='S1')
s2 = pd.Series(np.random.randn(5).round(2), index=list('cdefg'), name='S2')
s3 = pd.Series(np.random.randn(4).round(2), index=list('fghi'), name='S3')

print(s1, '\n\n S2:\n', s2, '\n\n S3:\n', s3)

a   -1.87
b    2.15
c    1.21
Name: S1, dtype: float64

 S2:
 c   -0.62
d   -1.03
e   -0.03
f   -1.34
g   -1.53
Name: S2, dtype: float64

 S3:
 f   -0.46
g    0.01
h   -0.61
i    2.08
Name: S3, dtype: float64

In [116]:
# Default action is to append the data
pd.concat([s1, s2, s3], axis=0)

a   -1.87
b    2.15
c    1.21
c   -0.62
d   -1.03
e   -0.03
f   -1.34
g   -1.53
f   -0.46
g    0.01
h   -0.61
i    2.08
dtype: float64

In [117]:
# concat with axis=1 (non-overlapping index)
print(pd.concat([s1, s2, s3], axis=1))

     S1    S2    S3
a -1.87   NaN   NaN
b  2.15   NaN   NaN
c  1.21 -0.62   NaN
d   NaN -1.03   NaN
e   NaN -0.03   NaN
f   NaN -1.34 -0.46
g   NaN -1.53  0.01
h   NaN   NaN -0.61
i   NaN   NaN  2.08

C:\Users\DELL-IN\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

In [118]:
# Passing keys= creates a hierarchical index when appending (axis=0)

pd.concat([s1, s2, s3], axis=0, keys=['one', 'two', 'thr'])

one  a   -1.87
     b    2.15
     c    1.21
two  c   -0.62
     d   -1.03
     e   -0.03
     f   -1.34
     g   -1.53
thr  f   -0.46
     g    0.01
     h   -0.61
     i    2.08
dtype: float64

In [119]:
# Passing keys= gives names to columns when using axis=1

print(pd.concat([s1, s2, s3], axis=1, keys=['S1', 'S2', 'S3']))

     S1    S2    S3
a -1.87   NaN   NaN
b  2.15   NaN   NaN
c  1.21 -0.62   NaN
d   NaN -1.03   NaN
e   NaN -0.03   NaN
f   NaN -1.34 -0.46
g   NaN -1.53  0.01
h   NaN   NaN -0.61
i   NaN   NaN  2.08

C:\Users\DELL-IN\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  This is separate from the ipykernel package so we can avoid doing imports until

b. Series objects with overlapping index
If there is an overlap on indexes, we can specify join= to intersect the data
Note that the join= option takes only 'inner' and 'outer'

In [120]:
s4 =pd.Series(np.random.randn(5), index=list('abcde'), name='S4')
print(s4)

a   -1.249173
b    1.316051
c   -0.855617
d   -1.915654
e   -0.904940
Name: S4, dtype: float64

In [121]:
# concat with overlapping index (default join type is outer)
print(pd.concat([s1, s4], axis=1))

     S1        S4
a -1.87 -1.249173
b  2.15  1.316051
c  1.21 -0.855617
d   NaN -1.915654
e   NaN -0.904940

C:\Users\DELL-IN\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

In [122]:
# if we specify a join type, this will be equivalent to a merge
print(pd.concat([s1, s4], axis=1, join='inner'))

     S1        S4
a -1.87 -1.249173
b  2.15  1.316051
c  1.21 -0.855617

Dealing with String Data
These include methods applied to string objects that

split a string by given delimiter - .split()
trim whitespace - .strip()
concatenate strings - .join()
detect substrings - .find() and .index()
count occurrences - .count()
find and replace - .replace()

In [123]:
s = 'ready, set ,   go '
s

'ready, set ,   go '

In [124]:
s.split(',')

['ready', ' set ', '   go ']

In [125]:
s.split(' ')

['ready,', 'set', ',', '', '', 'go', '']

In [126]:
'_'.join(s.split(','))

'ready_ set _   go '

In [127]:
# String Splitting
'_'.join([x.strip() for x in s.split(',')])

'ready_set_go'

In [128]:
# Trimming whitespace
pieces = [x.strip() for x in s.split(',')]
pieces
# Also see rstrip, lstrip

['ready', 'set', 'go']

In [129]:
'_#_'.join(list('abcde'))

'a_#_b_#_c_#_d_#_e'

In [130]:
# Concatenating Strings
print('::'.join(pieces))
print('--'.join(pieces))
print(' '.join(pieces))

ready::set::go
ready--set--go
ready set go

In [131]:
# Does a Substring belong to a string
print('steady' in s)
print('set' in s)

False
True

In [132]:
# Locate a substring
s.index('go')

15

In [133]:
s[15:17]

'go'

In [134]:
#find vs index
sentence = 'the sun rises in the east'
sentence.find('east')

21

In [135]:
sentence.index('east')

21

In [136]:
print(sentence.find('west'))
#print sentence.index('west') #it will throw an error

-1

In [137]:
# Locate a substring
s.find(',')

5

In [138]:
# Count occurrences
s.count(',')

2

In [139]:
sentence.endswith('east')

True

In [140]:
s2 = 'the quick brown fox jumps over the lazy dog'
s2.find('fox')

print('lazy' in s2)

print(s2.endswith('dog'))

True
True

In [141]:
s.startswith('ready')
# similarly .endswith()

True

HANDLING TIME SERIES DATA

In [142]:
pd.datetime.now()

datetime.datetime(2018, 8, 20, 22, 3, 45, 516042)

In [143]:
# Create a date value
# Syntax: pd.datetime(year, month, day, hour, mins)
dt_1 = pd.datetime(2016, 1, 1)
dt_1

datetime.datetime(2016, 1, 1, 0, 0)

In [144]:
# Create a date range
# Syntax: pd.date_range(start, stop, freq=)
pd.date_range(pd.datetime(2016, 1, 1), pd.datetime(2016, 7, 1), freq="W")

DatetimeIndex(['2016-01-03', '2016-01-10', '2016-01-17', '2016-01-24',
               '2016-01-31', '2016-02-07', '2016-02-14', '2016-02-21',
               '2016-02-28', '2016-03-06', '2016-03-13', '2016-03-20',
               '2016-03-27', '2016-04-03', '2016-04-10', '2016-04-17',
               '2016-04-24', '2016-05-01', '2016-05-08', '2016-05-15',
               '2016-05-22', '2016-05-29', '2016-06-05', '2016-06-12',
               '2016-06-19', '2016-06-26'],
              dtype='datetime64[ns]', freq='W-SUN')

In [145]:
dates = pd.date_range('1950-01', '2013-03', freq='M'); dates

DatetimeIndex(['1950-01-31', '1950-02-28', '1950-03-31', '1950-04-30',
               '1950-05-31', '1950-06-30', '1950-07-31', '1950-08-31',
               '1950-09-30', '1950-10-31',
               ...
               '2012-05-31', '2012-06-30', '2012-07-31', '2012-08-31',
               '2012-09-30', '2012-10-31', '2012-11-30', '2012-12-31',
               '2013-01-31', '2013-02-28'],
              dtype='datetime64[ns]', length=758, freq='M')

In [146]:
ts = pd.DataFrame(np.random.randn(758, 4), columns=list('ABCD'), index=dates)

In [147]:
#sub setting time series
# Between June 1951 to Jan 1952
ts[pd.datetime(1951, 6, 1):pd.datetime(1952, 1, 1)]

                   A         B         C         D
1951-06-30  0.543959  0.952601  0.120707 -0.710145
1951-07-31 -0.919395  0.021583 -1.573269  0.429841
1951-08-31 -0.779821  0.646315  1.755691  1.065718
1951-09-30 -0.048017  2.004453  2.558571 -0.795237
1951-10-31  0.268015 -0.576091  0.264578  1.020940
1951-11-30 -0.524932  0.474297 -0.598143  0.152009
1951-12-31 -0.780638 -0.366294  0.480013 -0.584915

In [148]:
ts['year'] = ts.index.year

In [149]:
ts['month']=ts.index.month

In [150]:
ts.head()

                   A         B         C         D  year  month
1950-01-31 -0.263975  0.450093 -0.595585  0.131153  1950      1
1950-02-28  0.447867 -1.300073  0.762673 -1.757761  1950      2
1950-03-31  0.705027 -0.287433 -0.225847 -1.357645  1950      3
1950-04-30 -0.033397  0.041341  2.016146  2.975010  1950      4
1950-05-31  0.495239 -0.494140 -2.144302 -0.024770  1950      5

In [151]:
# Aggregating data by year
print(ts.groupby('year').sum().tail(5))

             A         B         C         D  month
year
2009  7.368846 -4.012686  3.182630 -0.913822     78
2010 -3.062626  1.324536 -3.719736 -5.026190     78
2011 -0.177371 -3.447063  1.259829  2.353540     78
2012 -4.068861  0.485458 -4.301674  0.244390     78
2013  0.648039  0.869054 -2.277817 -0.418208      3